In [32]:
import pandas as pd
import numpy as np

# **Fundamental** Dataframes

Dataframe adalah kumpulan Series dan Series sama dengan NumPy Array 1 Dimensi  
Lalu **apakah kita bisa membuat Dataframes dari NumPy Array**?

In [33]:
array_a = np.array([[3, 2, 1], [6, 3, 2]])
array_a

array([[3, 2, 1],
       [6, 3, 2]])

In [34]:
pd.DataFrame(array_a)

   0  1  2
0  3  2  1
1  6  3  2

Jawabannya adalah **BISA!**  
Lihat ***array_a*** yang sebelumnya NumPy 2 Dimensi menjadi Pandas Dataframe

In [35]:
type(pd.DataFrame(array_a))

pandas.core.frame.DataFrame

## **Nama** Columns dan Index

Untuk memberi nama pada columns dan indexnya caranya sangat mudah

In [36]:
df = pd.DataFrame(array_a, columns = ['Column 1', 'Column 2', 'Column 3'], index = ['Row 1', 'Row 2'])
df

       Column 1  Column 2  Column 3
Row 1         3         2         1
Row 2         6         3         2

## **Membaca** File .csv

Praktik yang umum digunakan oleh Data Analis adalah membaca file .csv dengan **pd.read_csv**  
Kemudian menentukan kolom mana yang akan dijadikan index dengan **index_col**  
dan menampilkan lima baris pertama dari dataset dengan **.head()**

In [37]:
data = pd.read_csv('Lending-Company.csv', index_col = 'LoanID')
lending_co_data = data.copy()
lending_co_data.head()

,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
LoanID,,,,,,,,,,,,,,
1,LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
3,LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
5,LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [38]:
type(lending_co_data)

pandas.core.frame.DataFrame

# **Attribute** Dataframe

In [39]:
data = pd.read_csv('Lending-company.csv', index_col = 'LoanID')
lending_co_data = data.copy()
lending_co_data.head()

,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
LoanID,,,,,,,,,,,,,,
1,LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
3,LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
5,LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

## **.index**

Mengembalikan isi dari kolom index pada suatu dataset

In [40]:
lending_co_data.index

Int64Index([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,
            ...
            1034, 1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042, 1043],
           dtype='int64', name='LoanID', length=1043)

## **.columns**

Mengembalikan nama-nama kolom dari suatu dataset

In [41]:
lending_co_data.columns

Index(['StringID', 'Product', 'CustomerGender', 'Location', 'Region',
       'TotalPrice', 'StartDate', 'Deposit', 'DailyRate', 'TotalDaysYr',
       'AmtPaid36', 'AmtPaid60', 'AmtPaid360', 'LoanStatus'],
      dtype='object')

## **.axes**

**Menggabungkan fungsi** dari **.index** dan **.columns**  
Mengembalikan index dan nama-nama kolom dari suatu dataset

In [42]:
lending_co_data.axes

[Int64Index([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,
             ...
             1034, 1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042, 1043],
            dtype='int64', name='LoanID', length=1043),
 Index(['StringID', 'Product', 'CustomerGender', 'Location', 'Region',
        'TotalPrice', 'StartDate', 'Deposit', 'DailyRate', 'TotalDaysYr',
        'AmtPaid36', 'AmtPaid60', 'AmtPaid360', 'LoanStatus'],
       dtype='object')]

## **.dtypes**

Mengembalikan nama-nama kolom dari suatu dataset dan tipe data dari isi kolom tersebut

In [43]:
lending_co_data.dtypes

StringID           object
Product            object
CustomerGender     object
Location           object
Region             object
TotalPrice        float64
StartDate          object
Deposit             int64
DailyRate           int64
TotalDaysYr         int64
AmtPaid36           int64
AmtPaid60           int64
AmtPaid360          int64
LoanStatus         object
dtype: object

## **.to_numpy**

Mengubah **Dataframes menjadi NumPy Array** seperti yang disarankan  
*(tidak menggunakan .values)*

In [44]:
lending_co_data.to_numpy()

array([['LoanID_1', 'Product B', 'Female', ..., 4166, 14621, 'Active'],
       ['LoanID_2', 'Product D', 'Female', ..., 4096, 16041, 'Active'],
       ['LoanID_3', 'Product B', 'Male', ..., 3205, 16340, nan],
       ...,
       ['LoanID_1041', 'Product A', 'NotSpecified', ..., 5143, 16617,
        'Finished Payment'],
       ['LoanID_1042', 'Product B', 'Female', ..., 3462, 15617,
        'Finished Payment'],
       ['LoanID_1043', 'Product A', 'NotSpecified', ..., 4743, 16617,
        'Finished Payment']], dtype=object)

## **.shape**

Mengembalikan tuple yang berisi **jumlah baris dan jumlah kolom** suatu dataset  
Jumlah ini tidak termasuk kolom index dan nama masing-masing kolom

In [45]:
lending_co_data.shape

(1043, 14)

Sama seperti **len**

In [46]:
len(lending_co_data.columns)

14

# **Data Selection** pada DataFrames

Selection di Pandas bisa dengan dua cara, **cara pertama** adalah sebagai berikut

In [47]:
lending_co_data.Product

LoanID
1       Product B
2       Product D
3       Product B
4       Product A
5       Product B
          ...
1039    Product B
1040    Product A
1041    Product A
1042    Product B
1043    Product A
Name: Product, Length: 1043, dtype: object

**Cara kedua yang best practice** sebagai berikut

In [48]:
lending_co_data['Product']

LoanID
1       Product B
2       Product D
3       Product B
4       Product A
5       Product B
          ...
1039    Product B
1040    Product A
1041    Product A
1042    Product B
1043    Product A
Name: Product, Length: 1043, dtype: object

Cara kedua selalu digunakan karena **jika terdapat dua kata dan spasi di nama kolom, cara kedua masih bisa jalan**

Namun, harus diperhatikan  
**Best Practice Nama Column di Pandas adalah CamelCase**  usahakan jangan ada spasi

### Python **Case-Sensitive**  
Lihat code dibawah, L nya dalam lower-case sehingga error

In [49]:
lending_co_data['location']

KeyError: 'location'

### **Selection Output** Dataframe atau Series

Untuk menghasilkan **output series** saat selection, cukup menggunakan satu kurung siku saja

In [ ]:
lending_co_data['Location']

LoanID
1        Location 3
2        Location 6
3        Location 8
4       Location 26
5       Location 34
           ...
1039    Location 73
1040    Location 82
1041    Location 11
1042    Location 26
1043    Location 94
Name: Location, Length: 1043, dtype: object

Untuk menghasilkan **Dataframe, menggunakan dua kurung siku**. Indexingnya juga akan ditampilkan

In [ ]:
lending_co_data[['Location']]

           Location
LoanID
1        Location 3
2        Location 6
3        Location 8
4       Location 26
5       Location 34
...             ...
1039    Location 73
1040    Location 82
1041    Location 11
1042    Location 26
1043    Location 94

[1043 rows x 1 columns]

Cara ini digunakan **untuk menampilkan lebih dari satu kolom**

In [ ]:
lending_co_data[['Location', 'Product']].head()

           Location    Product
LoanID
1        Location 3  Product B
2        Location 6  Product D
3        Location 8  Product B
4       Location 26  Product A
5       Location 34  Product B

In [ ]:
prod_loc = ['Location', 'Product']
lending_co_data[prod_loc].head()

           Location    Product
LoanID
1        Location 3  Product B
2        Location 6  Product D
3        Location 8  Product B
4       Location 26  Product A
5       Location 34  Product B

## Data Selection dengan **.iloc [ ]**

singkatan dari ***integer - location based indexing***  
Seperti contoh sebelumnya, kita melihat selection dengan nama kolom. **Bagaimana caranya selection dengan index**?

In [ ]:
lending_co_data[1]

KeyError: 1

Jika menggunakan integer secara langsung maka akan error. Gunakan **.iloc [ ]**

In [ ]:
lending_co_data.iloc[1]

StringID            LoanID_2
Product            Product D
CustomerGender        Female
Location          Location 6
Region              Region 6
TotalPrice               NaN
StartDate         02/01/2019
Deposit                 2200
DailyRate                 45
TotalDaysYr              365
AmtPaid36               3161
AmtPaid60               4096
AmtPaid360             16041
LoanStatus            Active
Name: 2, dtype: object

Maka **yang dihasilkan adalah semua data untuk index ke 1** (hitung indexing dari 0) yaitu **LoanID_2**

In [ ]:
lending_co_data.iloc[1, 3]

'Location 6'

Bisa juga mengambil location nya saja yang ada di kolom ke empat (index kolom ke 3)

In [ ]:
lending_co_data.iloc[:, 3]

LoanID
1        Location 3
2        Location 6
3        Location 8
4       Location 26
5       Location 34
           ...
1039    Location 73
1040    Location 82
1041    Location 11
1042    Location 26
1043    Location 94
Name: Location, Length: 1043, dtype: object

In [ ]:
lending_co_data.iloc[[1, 3], :]

,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
LoanID,,,,,,,,,,,,,,
2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active

In [ ]:
lending_co_data.iloc[:, [1, 3]]

          Product     Location
LoanID
1       Product B   Location 3
2       Product D   Location 6
3       Product B   Location 8
4       Product A  Location 26
5       Product B  Location 34
...           ...          ...
1039    Product B  Location 73
1040    Product A  Location 82
1041    Product A  Location 11
1042    Product B  Location 26
1043    Product A  Location 94

[1043 rows x 2 columns]

Secara umum, **konsepnya sama seperti Indexing dengan NumPy**

## Data Selection dengan **.loc [ ]**

Sama seperti iloc, namun **penggunaannya dengan nama dari kolom dan nama indexnya**  
loc lebih sering digunakan dibanding iloc karena syntaxnya lebih mudah dimengerti

In [ ]:
data = pd.read_csv('Lending-company.csv', index_col = 'StringID')
lending_co_data = data.copy()
lending_co_data

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_2,2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
LoanID_3,3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
LoanID_4,4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
LoanID_5,5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
LoanID_1039,1039,Product B,Male,Location 73,Region 6,17300.0,29/12/2018,2200,45,365,3251,4743,16617,Finished Payment
LoanID_1040,1040,Product A,Male,Location 82,Region 1,NaN,28/03/2018,2200,45,365,4090,5582,16617,Finished Payment
LoanID_1041,1041,Product A,NotSpecified,Location 11,Region 4,17300.0,26/04/2018,2200,45,365,4051,5143,16617,Finished Payment
LoanID_1042,1042,Product B,Female,Location 26,Region 6,16300.0,25/10/2016,1000,45,365,1930,3462,15617,Finished Payment
LoanID_1043,1043,Product A,NotSpecified,Location 94,Region 6,17300.0,15/05/2019,2200,45,365,4451,4743,16617,Finished Payment

In [ ]:
lending_co_data.loc['LoanID_3']

LoanID                     3
Product            Product B
CustomerGender          Male
Location          Location 8
Region              Region 3
TotalPrice           16600.0
StartDate         08/12/2016
Deposit                 1000
DailyRate                 45
TotalDaysYr              365
AmtPaid36               2260
AmtPaid60               3205
AmtPaid360             16340
LoanStatus               NaN
Name: LoanID_3, dtype: object

In [ ]:
lending_co_data.loc['LoanID_3', 'Region']

'Region 3'

In [ ]:
lending_co_data.loc[:, ['Location', 'TotalPrice']]

                Location  TotalPrice
StringID
LoanID_1      Location 3     17600.0
LoanID_2      Location 6         NaN
LoanID_3      Location 8     16600.0
LoanID_4     Location 26     17600.0
LoanID_5     Location 34     21250.0
...                  ...         ...
LoanID_1039  Location 73     17300.0
LoanID_1040  Location 82         NaN
LoanID_1041  Location 11     17300.0
LoanID_1042  Location 26     16300.0
LoanID_1043  Location 94     17300.0

[1043 rows x 2 columns]

# **Do** and **Don't** when using .iloc dan .loc

Kita akan menggunakan data **Lending-Company.csv** untuk tutorial ini

In [ ]:
data = pd.read_csv('Lending-Company.csv', index_col = 'LoanID')
lending_co_data = data.copy()
lending_co_data

,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
LoanID,,,,,,,,,,,,,,
1,LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
3,LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
5,LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1039,LoanID_1039,Product B,Male,Location 73,Region 6,17300.0,29/12/2018,2200,45,365,3251,4743,16617,Finished Payment
1040,LoanID_1040,Product A,Male,Location 82,Region 1,NaN,28/03/2018,2200,45,365,4090,5582,16617,Finished Payment
1041,LoanID_1041,Product A,NotSpecified,Location 11,Region 4,17300.0,26/04/2018,2200,45,365,4051,5143,16617,Finished Payment
1042,LoanID_1042,Product B,Female,Location 26,Region 6,16300.0,25/10/2016,1000,45,365,1930,3462,15617,Finished Payment
1043,LoanID_1043,Product A,NotSpecified,Location 94,Region 6,17300.0,15/05/2019,2200,45,365,4451,4743,16617,Finished Payment

### Akses Kolom atau Baris Terakhir dengan **-1**

In [ ]:
lending_co_data.iloc[:, -1]

LoanID
1                 Active
2                 Active
3                    NaN
4                 Active
5                 Active
              ...
1039    Finished Payment
1040    Finished Payment
1041    Finished Payment
1042    Finished Payment
1043    Finished Payment
Name: LoanStatus, Length: 1043, dtype: object

## Apply .iloc atau .loc yang outputnya **Series**

Contoh kita ingin mengakses TotalPrice dari LoanID pertama  
Tentu **outputnya Series** karena hanya ada satu data saja yaitu 176000

### **DO** Only use Row Indexer

In [ ]:
lending_co_data['TotalPrice'].iloc[0]

17600.0

In [ ]:
lending_co_data['TotalPrice'].loc[1]

17600.0

### **DONT** Provide Column Indexer

Cara di bawah akan **error, karena terlalu banyak indexer**  
Karena nama kolom sudah dideklarasikan di awal dengan "TotalPrice"

In [ ]:
lending_co_data['TotalPrice'].iloc[0, :]

IndexingError: Too many indexers

Cara ini juga akan **error, karena 0 diartikan Python sebagai LoanID**  
Sedangkan LoanID 0 tidak ada di Dataset

In [ ]:
lending_co_data['TotalPrice'][0]

KeyError: 0

Cara ini bisa dilakukan namun **harus dihindari**  
Karena code menjadi ambigu, apakah 1 yang dimaksud LoanID atau Indexed-Based

In [ ]:
lending_co_data['TotalPrice'][1]

17600.0

## Be **Spesific**

Kita akan menggunakan Lending-Company.csv namun **mengubah indexnya menjadi column StringID**

In [ ]:
data = pd.read_csv('Lending-Company.csv', index_col = 'StringID')
lending_co_data = data.copy()
lending_co_data.head()

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_2,2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
LoanID_3,3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
LoanID_4,4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
LoanID_5,5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

### **DO** Be Spesific

Gunakan salah satu argumen dengan nama kolom, agar codenya mudah dibaca

In [ ]:
lending_co_data['TotalPrice'].iloc[0]

17600.0

In [ ]:
lending_co_data['TotalPrice'].loc['LoanID_1']

17600.0

### **DONT** Use Index Chaining

iloc dan loc dibuat agar **meningkatkan readability**  
sedangkan code dibawah mempersulitnya

In [ ]:
lending_co_data.iloc[0][5]

17600.0

**Jika** labelnya masih **menggunakan kolom LoanID**, dua blok code di bawah akan **error**

In [ ]:
lending_co_data['TotalPrice'][0]

17600.0

In [ ]:
lending_co_data['TotalPrice'][1]

nan

**Urutan penulisan indexing sebenarnya adalah Baris lalu Kolom**  
Code di bawah sebenarnya tidak salah dan jika dirun outputnya benar. **Namun penulisannya Kolom lalu Baris**  
Hal ini akan ambigu bagi pembaca code. **Hindari index-chaining**

In [ ]:
lending_co_data['TotalPrice']['LoanID_1']

17600.0

## **Labelling** Dataframes

Setelah melihat beberapa contoh di atas, penggunaan **Labelling pada Dataframes diusahakan jangan numeric values**  
Gunakan tipe data String agar terhindar dari ambigu dan kesalahan indexing

## **Berapa** Square Bracket?

### **DO** Semicolon untuk Readability

In [ ]:
lending_co_data.iloc[[0, 5], :]

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_6,6,Product A,Male,Location 34,Region 1,NaN,19/04/2019,2200,45,365,3301,4066,15141,Active

In [ ]:
lending_co_data.loc[['LoanID_1', 'LoanID_6'], :]

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_6,6,Product A,Male,Location 34,Region 1,NaN,19/04/2019,2200,45,365,3301,4066,15141,Active

### **DONT** Tidak menggunakan Semicolon

In [ ]:
lending_co_data.iloc[[0, 5]]

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_6,6,Product A,Male,Location 34,Region 1,NaN,19/04/2019,2200,45,365,3301,4066,15141,Active

In [ ]:
lending_co_data.loc[['LoanID_1', 'LoanID_6']]

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_6,6,Product A,Male,Location 34,Region 1,NaN,19/04/2019,2200,45,365,3301,4066,15141,Active

## **Combining** .iloc dan .loc

Cara ini jarang digunakan, karena untuk kasus tertentu yang ingin **outputnya berupa Series**

### **DO** .loc untuk mengakses Column dan .iloc untuk Row

In [ ]:
lending_co_data.loc[:,'TotalPrice'].iloc[[0,5]]

StringID
LoanID_1    17600.0
LoanID_6        NaN
Name: TotalPrice, dtype: float64

### **DONT** Menggabungkan Indexing Operator biasa dengan .iloc atau .loc

**TotalPrice** code di bawah menggunakan Indexing Operator biasa dan .iloc hanya untuk mengakses barisnya saja  
hal ini membuat ambigu dan mungkin kamu juga bingung cara baca codenya

In [ ]:
lending_co_data['TotalPrice'].iloc[[0, 5]]

StringID
LoanID_1    17600.0
LoanID_6        NaN
Name: TotalPrice, dtype: float64